Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
/**
 * @file    simple_scheduler.c
 * @author  Gross
 * @date    05.06.2026
 * @brief   Priority preemptive scheduler driver source
 */

#include <stdint.h>
#include <stddef.h>

#include "stm32n657xx.h"

#include "simple_scheduler.h"
#include "simple_timer.h"
#include "simple_debug_log.h"
#include "config.h"

// -------------------------------------------------------------------------
// Private defines / datatypes
// -------------------------------------------------------------------------

typedef struct {
	SCHEDULER_Task_Function_TypeDef	function;			//  0
	uint32_t						period_ms;			//  4
	uint32_t						last_run_ms;		//  8
	uint8_t							priority;			// 12
	uint8_t							state;				// 13 (_Task_State_TypeDef)
	uint32_t						saved_sp;			// 16 (4-byte aligned)
	uint32_t						saved_exc_return;	// 20
	const char*						pcName;				// 24
} _Task_Handle_TypeDef;							// 28 bytes

typedef enum {
	TaskDeleted   = 0,  // Slot free / task removed
	TaskBlocked   = 1,  // Waiting for period to expire / task returned
	TaskReady     = 2,  // Period has expired, ready to be scheduled
	TaskSuspended = 3   // Explicitly suspended
} _Task_State_TypeDef;

// TCB = Task Control Block
#define _TCB_SIZE           28    // sizeof(_Task_Handle_TypeDef)
#define _TCB_SAVED_SP       16
#define _TCB_EXC_RETURN     20

// Stack frame in words: S16-S31(16) + R4-R11(8) + exception frame(8)
// Must remain 32 regardless of _TCB_SIZE — ARM hardware exception frame is 8 words.
#define _STACK_FRAME_WORDS  32

// Stringify helper for inline assembly
#define _STR_HELPER(x) #x
#define _STR(x)        _STR_HELPER(x)

_Static_assert(offsetof(_Task_Handle_TypeDef, saved_sp) == _TCB_SAVED_SP, "TCB saved_sp offset mismatch with assembly");
_Static_assert(offsetof(_Task_Handle_TypeDef, saved_exc_return) == _TCB_EXC_RETURN, "TCB saved_exc_return offset mismatch with assembly");

_Static_assert(sizeof(_Task_Handle_TypeDef) == _TCB_SIZE, "TCB size mismatch with assembly");

// -------------------------------------------------------------------------
// Private data
// -------------------------------------------------------------------------

static _Task_Handle_TypeDef	_tasks[SCHEDULER_MAX_TASKS];
static volatile uint32_t	_sys_tick_ms = 0;
static int					_current_task = 0;

static volatile int			_scheduler_running = 0;

typedef struct {
	uint32_t					total_cycles;
	uint32_t					total_preempts;
	uint32_t					total_invocations;
	uint32_t					min_cycles;
	uint32_t					max_cycles;
	uint32_t					last_start_cycle;
} _Task_Stats_TypeDef;

static _Task_Stats_TypeDef	_task_stats[SCHEDULER_MAX_TASKS];
static uint32_t				_last_stats_print_cycle;
static volatile int			_stats_pending;

// ISR cycle tracking (written by ISR_enter/exit, consumed by PendSV and PrintStats)
static volatile uint32_t			_isr_total_cycles;
static volatile int					_isr_nest;
static volatile uint32_t			_isr_entry_cycle;
static volatile int					_isr_owner_task;
static volatile uint32_t			_task_isr_cycles[SCHEDULER_MAX_TASKS];

// Diagnostic: counts how many times WFI returns per stats window
static uint32_t						_idle_wakeups;

static uint32_t _stack_pool[SCHEDULER_STACK_POOL_SIZE_WORDS] __attribute__((aligned(8)));
static uint32_t* _task_stack_bases[SCHEDULER_MAX_TASKS];
static uint32_t  _task_stack_sizes[SCHEDULER_MAX_TASKS];
static uint32_t  _task_psplims[SCHEDULER_MAX_TASKS];
static uint32_t  _stack_pool_offset = 0;

_Static_assert(sizeof(_stack_pool) >= SCHEDULER_STACK_POOL_SIZE_WORDS * 4, "SCHEDULER_STACK_POOL_SIZE_WORDS mismatch");

volatile Scheduler_Fault_Dump_TypeDef g_sched_fault;

// Forward declarations (called from assembly)
void SCHEDULER_Task_exit(void);
static int SCHEDULER_SelectNextTask(void);
void SCHEDULER_FaultHandler_C(uint32_t exc_return, uint32_t *frame, uint32_t reason);
void SCHEDULER_StartTick(void);
static void SCHEDULER_PrintStats(void);

void UsageFault_Handler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void NMI_Handler(void);

// -------------------------------------------------------------------------
// Stack initialisation
// -------------------------------------------------------------------------

/**
 * @brief Initializes Task by filling with default values
 *
 * @param i | task index
 */
static void SCHEDULER_InitTaskStack(int i){
	uint32_t words = _task_stack_sizes[i];
	uint32_t *stack_base = (uint32_t *)((uint32_t)_task_stack_bases[i] & ~7U);

	for (uint32_t j = 0; j < words; j++) {
		stack_base[j] = 0xA5A5A5A5;
	}

	uint32_t *stack_end = (uint32_t *)((uint32_t)stack_base + words * 4);
	uint32_t *sp = stack_end - _STACK_FRAME_WORDS;

	// sp[0..15]  S16-S31  (FPU callee-saved)
	// sp[16..23] R4-R11   (core callee-saved)
	// sp[24..31] exception frame: R0-R3, R12, LR, PC, xPSR

	sp[_STACK_FRAME_WORDS - 3] = (uint32_t)SCHEDULER_Task_exit; // LR on task return
	sp[_STACK_FRAME_WORDS - 2] = (uint32_t)_tasks[i].function;  // PC
	sp[_STACK_FRAME_WORDS - 1] = 0x01000000UL;                  // xPSR (thumb bit)

	_tasks[i].saved_sp         = (uint32_t)&sp[16];
	_tasks[i].saved_exc_return = 0xFFFFFFFDUL;
}

// -------------------------------------------------------------------------
// Idle task
// -------------------------------------------------------------------------

/**
 * @brief Idle task - waits for the next interrupt
 */
__attribute__((noreturn)) static void SCHEDULER_IdleTask(void){
	while (1) {
		if (_stats_pending) {
			_stats_pending = 0;
//			SCHEDULER_PrintStats();
			_idle_wakeups = 0;
		}
		_idle_wakeups++;
		__WFI();
	}
}

// -------------------------------------------------------------------------
// Task exit handler
// -------------------------------------------------------------------------

/**
 * @brief Clean up and park the current task after it returns
 */
void SCHEDULER_Task_exit(void){
	__disable_irq();
	_tasks[_current_task].state = TaskBlocked;

	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
	__enable_irq();

	while (1) {
		__WFI();
	}
}

// -------------------------------------------------------------------------
// Scheduling policy
// -------------------------------------------------------------------------

/**
 * @brief Selects next task with round robin and priority scheduling
 *
 * Chooses the highest-priority task that is both active and ready.
 * Tasks are scanned starting from the task immediately after the
 * currently running task and wrap around the task table, providing
 * round-robin fairness among tasks with the same priority.
 *
 * @return index of next Task to run
 */
static int SCHEDULER_SelectNextTask(void){
	int best = -1;
	uint8_t best_prio = 0xFF;

